IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f280013x_dcsm_z1_otp_regs.xml
<module id="DCSM_Z1_OTP" HW_revision="" description="DCSM Z1 OTP Registers">
	<register id="Z1OTP_LINKPOINTER1" width="32" page="1" offset="0x0" internal="0" description="Zone 1 Link Pointer1">
		<bitfield id="Z1OTP_LINKPOINTER1" description="Zone1 Link Pointer 1 location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1OTP_LINKPOINTER2" width="32" page="1" offset="0x2" internal="0" description="Zone 1 Link Pointer2">
		<bitfield id="Z1OTP_LINKPOINTER2" description="Zone1 Link Pointer 2 location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1OTP_LINKPOINTER3" width="32" page="1" offset="0x4" internal="0" description="Zone 1 Link Pointer3">
		<bitfield id="Z1OTP_LINKPOINTER3" description="Zone1 Link Pointer 3 location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1OTP_JLM_ENABLE" width="32" page="1" offset="0x6" internal="0" description="Zone 1 JTAGLOCK Enable Register">
		<bitfield id="Z1OTP_JLM_ENABLE" description="Zone1 JLM_ENABLE location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1OTP_GPREG1" width="32" page="1" offset="0x8" internal="0" description="Zone 1 General Purpose Register 1">
		<bitfield id="Z1OTP_GPREG1" description="Zone1 General Purpose register location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1OTP_GPREG2" width="32" page="1" offset="0xa" internal="0" description="Zone 1 General Purpose Register 2">
		<bitfield id="Z1OTP_GPREG2" description="Zone1 General Purpose register location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1OTP_GPREG3" width="32" page="1" offset="0xc" internal="0" description="Zone 1 General Purpose Register 3">
		<bitfield id="Z1OTP_GPREG3" description="Zone1 General Purpose register location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1OTP_GPREG4" width="32" page="1" offset="0xe" internal="0" description="Zone 1 General Purpose Register 4">
		<bitfield id="Z1OTP_GPREG4" description="Zone1 General Purpose register location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1OTP_PSWDLOCK" width="32" page="1" offset="0x10" internal="0" description="Secure Password Lock">
		<bitfield id="Z1OTP_PSWDLOCK" description="Zone1 Password lock location in USER OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1OTP_JTAGPSWDH0" width="32" page="1" offset="0x14" internal="0" description="JTAG Lock Permanent Password 0">
		<bitfield id="JTAGPSWDH0" description="JTAG Lock Password High 0 location in USER Z1 OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1OTP_JTAGPSWDH1" width="32" page="1" offset="0x16" internal="0" description="JTAG Lock Permanent Password 1">
		<bitfield id="JTAGPSWDH1" description="JTAG Lock Password High 1 location in USER Z1 OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1OTP_CMACKEY0" width="32" page="1" offset="0x18" internal="0" description="Secure Boot CMAC Key 0">
		<bitfield id="CMACKEY0" description="Secure Boot CMAC Key 0 location in User Z1 OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1OTP_CMACKEY1" width="32" page="1" offset="0x1a" internal="0" description="Secure Boot CMAC Key 1">
		<bitfield id="CMACKEY1" description="Secure Boot CMAC Key 1 location in User Z1 OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1OTP_CMACKEY2" width="32" page="1" offset="0x1c" internal="0" description="Secure Boot CMAC Key 2">
		<bitfield id="CMACKEY2" description="Secure Boot CMAC Key 2 location in User Z1 OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1OTP_CMACKEY3" width="32" page="1" offset="0x1e" internal="0" description="Secure Boot CMAC Key 3">
		<bitfield id="CMACKEY3" description="Secure Boot CMAC Key 3 location in User Z1 OTP." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
</module>
